{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, null, null], "input_dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "bn_double_0_activ_1"}, "inbound_nodes": [[["input", 0, 0]]], "name": "bn_double_0_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "bn_double_0", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["bn_double_0_activ_1", 0, 0]]], "name": "bn_double_0"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_1_activ_1"}, "inbound_nodes": [[["bn_double_0", 0, 0]]], "name": "block_1_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_1_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_1_activ_1", 0, 0]]], "name": "block_1_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["block_1_conv_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_1_activ_2"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "block_1_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_1_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_1_activ_2", 0, 0]]], "name": "block_1_conv_2"}, {"class_name": "Lambda", "config": {"function": ["c\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000C@\u0000\u0000s\b\u0000\u0000\u0000|\u0001\u0000|\u0000\u0000\u0014S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000xt\u0007\u0000\u0000\u0000scaling(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001e\u0000\u0000\u0000../proj_utils/kerasOneModel.pyt\b\u0000\u0000\u0000_scaling\u0010\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {"scaling": 0.5}, "output_shape": ["c\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0001\u0000\u0000\u0000C@\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shapet\u0003\u0000\u0000\u0000cls(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001e\u0000\u0000\u0000../proj_utils/kerasOneModel.pyt\u0015\u0000\u0000\u0000_scaling_output_shape\u000e\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["block_1_conv_2", 0, 0]], [["block_2_conv_2", 0, 0]], [["block_3_conv_2", 0, 0]], [["block_4_conv_2", 0, 0]], [["block_5_conv_2", 0, 0]], [["deconv_2_conv_2", 0, 0]], [["deconv_3_conv_2", 0, 0]], [["deconv_4_conv_2", 0, 0]], [["deconv_5_conv_2", 0, 0]]], "name": "lambda_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn_double_0", 0, 0], ["lambda_1", 0, 0]]], "name": "merge_1"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "bn_double_1_activ_1"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "bn_double_1_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "bn_double_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["bn_double_1_activ_1", 0, 0]]], "name": "bn_double_1"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["bn_double_1", 0, 0]]], "name": "averagepooling2d_1"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_2_activ_1"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]], "name": "block_2_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_2_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_2_activ_1", 0, 0]]], "name": "block_2_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["block_2_conv_1", 0, 0]]], "name": "dropout_2"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_2_activ_2"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "block_2_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_2_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_2_activ_2", 0, 0]]], "name": "block_2_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["lambda_1", 1, 0]]], "name": "merge_2"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "bn_double_2_activ_1"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "bn_double_2_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "bn_double_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["bn_double_2_activ_1", 0, 0]]], "name": "bn_double_2"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["bn_double_2", 0, 0]]], "name": "averagepooling2d_2"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_3_activ_1"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0]]], "name": "block_3_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_3_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_3_activ_1", 0, 0]]], "name": "block_3_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["block_3_conv_1", 0, 0]]], "name": "dropout_3"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_3_activ_2"}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "block_3_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_3_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_3_activ_2", 0, 0]]], "name": "block_3_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["lambda_1", 2, 0]]], "name": "merge_3"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "bn_double_3_activ_1"}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "bn_double_3_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "bn_double_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["bn_double_3_activ_1", 0, 0]]], "name": "bn_double_3"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["bn_double_3", 0, 0]]], "name": "averagepooling2d_3"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_4_activ_1"}, "inbound_nodes": [[["averagepooling2d_3", 0, 0]]], "name": "block_4_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_4_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_4_activ_1", 0, 0]]], "name": "block_4_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["block_4_conv_1", 0, 0]]], "name": "dropout_4"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_4_activ_2"}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "block_4_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_4_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_4_activ_2", 0, 0]]], "name": "block_4_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_3", 0, 0], ["lambda_1", 3, 0]]], "name": "merge_4"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "averagepooling2d_4"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_5_activ_1"}, "inbound_nodes": [[["averagepooling2d_4", 0, 0]]], "name": "block_5_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_5_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_5_activ_1", 0, 0]]], "name": "block_5_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["block_5_conv_1", 0, 0]]], "name": "dropout_5"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "block_5_activ_2"}, "inbound_nodes": [[["dropout_5", 0, 0]]], "name": "block_5_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "block_5_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block_5_activ_2", 0, 0]]], "name": "block_5_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_4", 0, 0], ["lambda_1", 4, 0]]], "name": "merge_5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "upsampling2d_1"}, {"class_name": "Resize2D", "config": {"trainable": true, "name": "Resize2D"}, "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "name": "resize2d_1"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["resize2d_1", 0, 0], ["merge_4", 0, 0]]], "name": "merge_6"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "up_bn_conv_2_bn1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "up_bn_conv_2_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "up_bn_conv_2_activ_1"}, "inbound_nodes": [[["up_bn_conv_2_bn1", 0, 0]]], "name": "up_bn_conv_2_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "up_bn_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["up_bn_conv_2_activ_1", 0, 0]]], "name": "up_bn_conv_2"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_2_activ_1"}, "inbound_nodes": [[["up_bn_conv_2", 0, 0]]], "name": "deconv_2_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_2_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_2_activ_1", 0, 0]]], "name": "deconv_2_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["deconv_2_conv_1", 0, 0]]], "name": "dropout_6"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_2_activ_2"}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "deconv_2_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_2_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_2_activ_2", 0, 0]]], "name": "deconv_2_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["up_bn_conv_2", 0, 0], ["lambda_1", 5, 0]]], "name": "merge_7"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "upsampling2d_2"}, {"class_name": "Resize2D", "config": {"trainable": true, "name": "Resize2D"}, "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "name": "resize2d_2"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["resize2d_2", 0, 0], ["merge_3", 0, 0]]], "name": "merge_8"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "up_bn_conv_3_bn1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "up_bn_conv_3_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "up_bn_conv_3_activ_1"}, "inbound_nodes": [[["up_bn_conv_3_bn1", 0, 0]]], "name": "up_bn_conv_3_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "up_bn_conv_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["up_bn_conv_3_activ_1", 0, 0]]], "name": "up_bn_conv_3"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_3_activ_1"}, "inbound_nodes": [[["up_bn_conv_3", 0, 0]]], "name": "deconv_3_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_3_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_3_activ_1", 0, 0]]], "name": "deconv_3_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_7"}, "inbound_nodes": [[["deconv_3_conv_1", 0, 0]]], "name": "dropout_7"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_3_activ_2"}, "inbound_nodes": [[["dropout_7", 0, 0]]], "name": "deconv_3_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_3_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_3_activ_2", 0, 0]]], "name": "deconv_3_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["up_bn_conv_3", 0, 0], ["lambda_1", 6, 0]]], "name": "merge_9"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "upsampling2d_3"}, {"class_name": "Resize2D", "config": {"trainable": true, "name": "Resize2D"}, "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "name": "resize2d_3"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["resize2d_3", 0, 0], ["merge_2", 0, 0]]], "name": "merge_10"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "up_bn_conv_4_bn1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "up_bn_conv_4_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "up_bn_conv_4_activ_1"}, "inbound_nodes": [[["up_bn_conv_4_bn1", 0, 0]]], "name": "up_bn_conv_4_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "up_bn_conv_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["up_bn_conv_4_activ_1", 0, 0]]], "name": "up_bn_conv_4"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_4_activ_1"}, "inbound_nodes": [[["up_bn_conv_4", 0, 0]]], "name": "deconv_4_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_4_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_4_activ_1", 0, 0]]], "name": "deconv_4_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_8"}, "inbound_nodes": [[["deconv_4_conv_1", 0, 0]]], "name": "dropout_8"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_4_activ_2"}, "inbound_nodes": [[["dropout_8", 0, 0]]], "name": "deconv_4_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_4_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_4_activ_2", 0, 0]]], "name": "deconv_4_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["up_bn_conv_4", 0, 0], ["lambda_1", 7, 0]]], "name": "merge_11"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "upsampling2d_4"}, {"class_name": "Resize2D", "config": {"trainable": true, "name": "Resize2D"}, "inbound_nodes": [[["upsampling2d_4", 0, 0]]], "name": "resize2d_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "up_bn_conv_5_bn1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["resize2d_4", 0, 0]]], "name": "up_bn_conv_5_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "up_bn_conv_5_activ_1"}, "inbound_nodes": [[["up_bn_conv_5_bn1", 0, 0]]], "name": "up_bn_conv_5_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "up_bn_conv_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["up_bn_conv_5_activ_1", 0, 0]]], "name": "up_bn_conv_5"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_5_activ_1"}, "inbound_nodes": [[["up_bn_conv_5", 0, 0]]], "name": "deconv_5_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_5_conv_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_5_activ_1", 0, 0]]], "name": "deconv_5_conv_1"}, {"class_name": "Dropout", "config": {"p": 0.33, "trainable": true, "name": "dropout_9"}, "inbound_nodes": [[["deconv_5_conv_1", 0, 0]]], "name": "dropout_9"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "deconv_5_activ_2"}, "inbound_nodes": [[["dropout_9", 0, 0]]], "name": "deconv_5_activ_2"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "deconv_5_conv_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["deconv_5_activ_2", 0, 0]]], "name": "deconv_5_conv_2"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["up_bn_conv_5", 0, 0], ["lambda_1", 8, 0]]], "name": "merge_12"}, {"class_name": "Activation", "config": {"activation": "f", "trainable": true, "name": "output_mask_activ_1"}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "output_mask_activ_1"}, {"class_name": "Convolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "output_mask", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "orthogonal", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "W_regularizer": {"l2": 1.0000000116860974e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["output_mask_activ_1", 0, 0]]], "name": "output_mask"}], "input_layers": [["input", 0, 0]], "output_layers": [["output_mask", 0, 0]], "name": "model_1"}}